# NLS_MESSAGEFORMAT_ALL
# NLS_ENCODING=UNICODE
# com.ibm.streamsx.objectstorage Messages Range CDIST3300 to CDIST3399 

# TRNOTE - Do not translate: SPL
OBJECTSTORAGE_NOT_CONSISTENT_REGION=CDIST3300E O operador a seguir n\u00e3o pode ser o in\u00edcio de uma regi\u00e3o consistente quando uma porta de entrada est\u00e1 presente: ''{0}''.
OBJECTSTORAGE_ASYNC_UNABLE_WRITE_TO_STREAMS=CDIST3301E N\u00e3o foi poss\u00edvel gravar no fluxo de sa\u00edda do COS.
OBJECTSTORAGE_ASYNC_UNABLE_ADD_TO_QUEUE=CDIST3302E N\u00e3o foi poss\u00edvel incluir o buffer na fila de buffers.
OBJECTSTORAGE_ASYNC_INVALID_BUFFER_QUEUE=CDIST3303E Erro ao configurar a fila de buffers.
OBJECTSTORAGE_ASYNC_SERVICE_SHUTDOWN_INTERRUPTED=CDIST3304W O encerramento do Servi\u00e7o de Execu\u00e7\u00e3o foi interrompido.
OBJECTSTORAGE_ASYNC_UNABLE_GET_BUFFER_QUEUE=CDIST3305E N\u00e3o foi poss\u00edvel recuperar o buffer da fila de buffers.
OBJECTSTORAGE_DS_INVALID_INPUT_PORT=CDIST3306E A porta de entrada de controle de ''ObjectStorageScan'' espera um \u00fanico atributo. O tipo desse atributo deve ser ''rstring''.
OBJECTSTORAGE_DS_INVALID_ATTRIBUTE=CDIST3307E \u00c9 esperado um atributo do tipo ''rstring'', mas foi localizado o atributo do tipo ''{0}''. 
OBJECTSTORAGE_DS_CONSISTENT_REGION_NOT_SUPPORTED=CDIST3308W A presen\u00e7a de uma porta de controle n\u00e3o \u00e9 suportada em uma regi\u00e3o consistente. As informa\u00e7\u00f5es de controle n\u00e3o podem ser reproduzidas, persistidas e restauradas corretamente. Pode ser necess\u00e1rio reproduzir manualmente os sinais de controle para trazer o operador de volta a um estado consistente."
OBJECTSTORAGE_DS_INVALID_OUTPUT_PORT=CDIST3309E A porta de sa\u00edda do operador ObjectStorageScan espera um \u00fanico atributo. O tipo desse atributo deve ser ''rstring''.
OBJECTSTORAGE_DS_INVALID_DIRECTORY_PARAM=CDIST3310E O par\u00e2metro do diret\u00f3rio deve ser especificado quando o operador n\u00e3o tem nenhuma porta de entrada.
OBJECTSTORAGE_DS_INVALID_SLEEP_TIMER_PARAM=CDIST3311E O valor sleepTime do par\u00e2metro do operador n\u00e3o deve ser menor que 0.
OBJECTSTORAGE_DS_INVALID_INIT_DELAY_PARAM=CDIST3312E O valor initDelay do par\u00e2metro do operador n\u00e3o deve ser menor que 0.
OBJECTSTORAGE_DS_INVALID_PATTERN_PARAM=CDIST3313E \u00e9 um padr\u00e3o inv\u00e1lido.
OBJECTSTORAGE_DS_INVALID_URL_PARAM=CDIST3314E O par\u00e2metro ''{0}'' cont\u00e9m um URI inv\u00e1lido: ''{1}''.
OBJECTSTORAGE_DS_INVALID_DIRECTORY_SCHEMA=CDIST3315E O esquema ''directory'' ''{0}'' deve corresponder ao esquema ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_DS_INVALID_HOST_DIRECTORY_SCHEMA=CDIST3316E O host e a porta especificados pelo par\u00e2metro ''directory'' ''{0}'' devem corresponder ao host e \u00e0 porta especificados pelo par\u00e2metro ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_DS_NOT_SPECIFIED_DIRECTORY_PARAM=CDIST3317E O par\u00e2metro directory precisa ser especificado quando a porta de entrada de controle n\u00e3o est\u00e1 presente.
OBJECTSTORAGE_DS_NOT_SPECIFIED_DIR_PARAM=CDIST3318E O par\u00e2metro directory n\u00e3o foi especificado. Varredura baseada na entrada da porta de controle.
OBJECTSTORAGE_DS_EMPTY_DIRECTORY_STRICT_MODE=CDIST3319E O par\u00e2metro strictMode est\u00e1 configurado como true, mas o par\u00e2metro directory est\u00e1 vazio.
OBJECTSTORAGE_DS_DIRECTORY_NOT_EXIST_STRICT_MODE=CDIST3320E O par\u00e2metro ''strictMode'' est\u00e1 configurado como true, mas o diret\u00f3rio ''{0}'' n\u00e3o existe.
OBJECTSTORAGE_DS_IS_NOT_A_DIRECTORY=CDIST3321E O valor do par\u00e2metro ''directory'' ''{0}'' n\u00e3o se refere a um diret\u00f3rio v\u00e1lido.
OBJECTSTORAGE_DS_EMPTY_DIRECTORY_PARAM=CDIST3322E O valor do par\u00e2metro directory est\u00e1 vazio.
OBJECTSTORAGE_DS_EMPTY_DIRECTORY_NOT_CONTROL_PORT=CDIST3323E O valor do par\u00e2metro directory est\u00e1 vazio e a porta de entrada de controle n\u00e3o est\u00e1 especificada.
OBJECTSTORAGE_DS_DIRECTORY_NOT_EXIST=CDIST3324E O diret\u00f3rio especificado ''{0}'' n\u00e3o existe.
OBJECTSTORAGE_DS_DIRECTORY_NOT_EXIST_INPUT_PORT=CDIST3325E O diret\u00f3rio especificado da porta de entrada de controle ''{0}'' n\u00e3o existe. 
OBJECTSTORAGE_DS_INVALID_DIRECTORY_INPUT_PORT=CDIST3326E O diret\u00f3rio especificado a partir da porta de entrada de controle ''{0}'' n\u00e3o \u00e9 um diret\u00f3rio v\u00e1lido.
OBJECTSTORAGE_DS_EMPTY_DIRECTORY_INPUT_PORT=CDIST3327E O diret\u00f3rio recebido da porta de entrada est\u00e1 vazio.
OBJECTSTORAGE_DS_PUNCTUATION_FAILED=CDIST3328E Problema ao enviar a pontua\u00e7\u00e3o final ''{0}''.
OBJECTSTORAGE_DS_SUBMITTING_FAILED=CDIST3329E Problema ao enviar a tupla ''{0}''.
OBJECTSTORAGE_SINK_OUTPUT_PORT=CDIST3330E A porta de sa\u00edda opcional deve ter dois atributos, ''rstring'' para o nome de objeto e ''uint64'' para o tamanho do objeto.
OBJECTSTORAGE_SINK_FIRST_OUTPUT_PORT=CDIST3331E O primeiro atributo na porta de sa\u00edda opcional deve ser um ''rstring''.
OBJECTSTORAGE_SINK_SECOND_OUTPUT_PORT=CDIST3332E O segundo atributo na porta de sa\u00edda opcional deve ser um ''uint64''.
OBJECTSTORAGE_SINK_ONE_ATTR_INPUT_PORT=CDIST3333E O fluxo de entrada deve ter um atributo, a menos que ''{0}'' esteja especificado.
OBJECTSTORAGE_SINK_TWO_ATTR_INPUT_PORT=CDIST3334E O fluxo de entrada deve ter um atributo, a menos que ''{0}'' e dois atributos quando ''{1}'' \u00e9 ''true''.
OBJECTSTORAGE_SINK_INVALID_ATTR_TYPE=CDIST3335E Esperado atributo do tipo ''blob'', ''rstring'' ou ''ustring'' na porta de entrada, localizado o atributo do tipo ''{1}''. 
OBJECTSTORAGE_SINK_INVALID_NAME_TYPE=CDIST3336E O atributo objectname deve ser do tipo ''ustring'' ou ''rstring''. O atributo de dados deve ser do tipo ''blob'', ''ustring'' ou ''rstring''.
#CDIST3337E
OBJECTSTORAGE_SINK_INVALID_VALUE_BYTEPEROBJECT=CDIST3338E O valor do par\u00e2metro ''bytesPerObject'' do operador n\u00e3o deve ser menor que 0.
OBJECTSTORAGE_SINK_INVALID_VALUE_TUPLESPEROBJECT=CDIST3339E O valor do par\u00e2metro ''tuplesPerObject'' do operador n\u00e3o deve ser menor que 0.
OBJECTSTORAGE_SINK_INVALID_VALUE_TIMEPEROBJECT=CDIST3340E O valor do par\u00e2metro ''timePerObject'' do operador n\u00e3o deve ser menor que 0.
OBJECTSTORAGE_SINK_INVALID_DATA_ATTR_TYPE=CDIST3341E O atributo de dados deve ter o tipo ''ustring'', ''rstring'' ou ''blob''. Localizado atributo do tipo ''{0}''. 
OBJECTSTORAGE_SINK_WRONG_TYPE=CDIST3342E \u00c9 esperado um atributo do tipo ''rstring'' ou ''ustring'' na porta de entrada, mas foi localizado o atributo do tipo ''{0}''.
OBJECTSTORAGE_SINK_NO_ATTRIBUTE=CDIST3343E Nenhum atributo no fluxo de entrada.
OBJECTSTORAGE_SINK_INVALID_SCHEMA=CDIST3344E O esquema ''objectName'' ''{0}'' deve corresponder ao esquema ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_SINK_INVALID_HOST=CDIST3345E O host e a porta especificados pelo par\u00e2metro ''objectName'' ''{0}'' devem corresponder ao host e \u00e0 porta especificados pelo par\u00e2metro ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_SINK_SET_RESTARTING=CDIST3346E Configure a reinicializa\u00e7\u00e3o como true.
OBJECTSTORAGE_SOURCE_INVALID_URL=CDIST3347E N\u00e3o foi poss\u00edvel construir o URI: ''{0}''.
OBJECTSTORAGE_SOURCE_INVALID_PARAM=CDIST3348E O operador requer que o par\u00e2metro ''objectName'' seja especificado ou que o n\u00famero de portas de entrada seja um.
OBJECTSTORAGE_SOURCE_ONLY_ONE_PARAM=CDIST3349E O operador requer que um par\u00e2metro ''objectName'' seja especificado ou que o n\u00famero de portas de entrada seja um. Ambos n\u00e3o podem ser especificados juntos.
OBJECTSTORAGE_SOURCE_INVALID_OUTPUT=CDIST3350E A porta de sa\u00edda pode ter somente um atributo. O tipo desse atributo deve ser ''rstring'', ''ustring'' ou ''blob''.
OBJECTSTORAGE_SOURCE_INVALID_ATTR_TYPE=CDIST3351E \u00c9 esperado um atributo do tipo ''rstring'', ''ustring'' ou ''blob'', mas foi localizado o atributo do tipo ''{0}''.
OBJECTSTORAGE_SOURCE_INVALID_BLOCKSIZE_PARAM=CDIST3352E O ''{0}'' pode ser usado somente quando o atributo ''outstream'' \u00e9 do tipo ''blob''.
OBJECTSTORAGE_SOURCE_INVALID_FILENAME_ATTR=CDIST3353E \u00c9 esperado somente um atributo na porta de entrada. O atributo deve ser ''rstring'' fornecendo um objeto a ser aberto.
OBJECTSTORAGE_SOURCE_INVALID_STRING_ATTR=CDIST3354E \u00c9 esperado um atributo do tipo ''rstring'', mas foi localizado o atributo do tipo ''{0}''.
OBJECTSTORAGE_SOURCE_INVALID_OBJECTSTORAGE_URL=CDIST3355E O par\u00e2metro ''objectStorageUri'' cont\u00e9m um URI inv\u00e1lido: ''{0}''. 
OBJECTSTORAGE_SOURCE_INVALID_SCHEMA=CDIST3356E O esquema ''objectName'' ''{0}'' deve corresponder ao esquema ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_SOURCE_INVALID_FILE_URL=CDIST3357E O par\u00e2metro ''objectName'' cont\u00e9m um URI inv\u00e1lido: ''{0}''.
OBJECTSTORAGE_SOURCE_INVALID_HOST=CDIST3358E O host e a porta especificados pelo par\u00e2metro ''objectName'' ''{0}'' devem corresponder ao host e \u00e0 porta especificados pelo par\u00e2metro ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_SOURCE_PROCESS_OBJECT=CDIST3359I Objeto de processo: ''{0}''.
OBJECTSTORAGE_SOURCE_NOT_OPENING_OBJECT=CDIST3360E Problema ao abrir objeto: ''{0}''.
OBJECTSTORAGE_SOURCE_EXCEPTION_READ_OBJECT=CDIST3361E Ocorreu uma exce\u00e7\u00e3o durante a leitura: ''{0}''. 
OBJECTSTORAGE_SOURCE_INIT_DELAY_INTERRUPTED=CDIST3362E Atraso de inicializa\u00e7\u00e3o interrompido.
OBJECTSTORAGE_SOURCE_EMPTY_OBJECT_NAME=CDIST3363E O nome do objeto \u00e9 uma sequ\u00eancia de caracteres vazia. Ignorando.
OBJECTSTORAGE_SOURCE_INVALID_INIT_DELAY_PARAM=CDIST3364E O valor do par\u00e2metro initDelay do operador n\u00e3o deve ser menor que 0.
#CDIST3365E 
OBJECTSTORAGE_SINK_AUTH_CONNECT=CDIST3366E Falha ao conectar-se ao terminal de Armazenamento de Objeto de Nuvem: ''{0}''.
OBJECTSTORAGE_NOT_CHECKPOINT_PERIODIC=CDIST3367E O operador a seguir n\u00e3o suporta a configura\u00e7\u00e3o de ponto de verifica\u00e7\u00e3o ''periodic'': ''{0}''.
OBJECTSTORAGE_NOT_CHECKPOINT_OPERATOR_DRIVEN=CDIST3368E O operador a seguir n\u00e3o suporta a configura\u00e7\u00e3o do ponto de verifica\u00e7\u00e3o ''operatorDriven'': ''{0}''. 
OBJECTSTORAGE_SINK_PARQUET_STORAGE_FORMAT_REQUIRED=CDIST3369E O par\u00e2metro de configura\u00e7\u00e3o Parquet espec\u00edfico ''{0}'' requer que o par\u00e2metro de formato de armazenamento ''{1}'' seja configurado como o valor ''{2}'' 
OBJECTSTORAGE_SINK_PARTION_VALUE_ATTRIBUTES_REQUIRED=CDIST3370E O par\u00e2metro de configura\u00e7\u00e3o espec\u00edfico da parti\u00e7\u00e3o ''{0}'' requer que o par\u00e2metro de atributos de parti\u00e7\u00e3o ''{1}'' seja definido
OBJECTSTORAGE_SINK_OBJECT_CLOSED_PRIOR_RP_EXPIRY=CDIST3371W O objeto ''{0}'' fechou antes de ocorrer a expira\u00e7\u00e3o da pol\u00edtica.
OBJECTSTORAGE_SINK_MAX_PARTITIONS_COUNT_REACHED=CDIST3372W O n\u00famero de objetos ativos (parti\u00e7\u00f5es) ''{0}'' excede o limite de cache ''{1}''. Para evitar a degrada\u00e7\u00e3o do desempenho, \u00e9 altamente recomendado reduzir o n\u00famero de parti\u00e7\u00f5es ativas.
OBJECTSTORAGE_SINK_OBJECT_WRITE_FAILURE=CDIST3373E Falha ao gravar o objeto ''{0}{1}'': ''{2}''.
OBJECTSTORAGE_SINK_OBJECT_CLOSE_FAILURE=CDIST3374E Falha ao fechar o objeto ''{0}{1}'': ''{2}''.
OBJECTSTORAGE_BUCKET_NOT_FOUND=CDIST3375E O dep\u00f3sito ''{0}'' n\u00e3o existe.
OBJECTSTORAGE_SINK_INVALID_URL=CDIST3376E N\u00e3o foi poss\u00edvel construir o URI para o objeto com o nome: ''{0}''.
