# NLS_MESSAGEFORMAT_ALL
# NLS_ENCODING=UNICODE
# com.ibm.streamsx.objectstorage Messages Range CDIST3300 to CDIST3399 

# TRNOTE - Do not translate: SPL
OBJECTSTORAGE_NOT_CONSISTENT_REGION=CDIST3300E L''op\u00e9rateur suivant ne peut pas \u00eatre au d\u00e9but d''une r\u00e9gion coh\u00e9rente lorsqu''un port d''entr\u00e9e est pr\u00e9sent : ''{0}''.
OBJECTSTORAGE_ASYNC_UNABLE_WRITE_TO_STREAMS=CDIST3301E Impossible d''\u00e9crire dans le flux de sortie COS.
OBJECTSTORAGE_ASYNC_UNABLE_ADD_TO_QUEUE=CDIST3302E Impossible d''ajouter la m\u00e9moire tampon \u00e0 la file d''attente de m\u00e9moire tampon.
OBJECTSTORAGE_ASYNC_INVALID_BUFFER_QUEUE=CDIST3303E Erreur lors de la configuration de la file d''attente de m\u00e9moire tampon.
OBJECTSTORAGE_ASYNC_SERVICE_SHUTDOWN_INTERRUPTED=CDIST3304W L''arr\u00eat du service d''ex\u00e9cution est interrompu.
OBJECTSTORAGE_ASYNC_UNABLE_GET_BUFFER_QUEUE=CDIST3305E Impossible d''extraire la m\u00e9moire tampon de la file d''attente de m\u00e9moire tampon.
OBJECTSTORAGE_DS_INVALID_INPUT_PORT=CDIST3306E Le port d''entr\u00e9e de contr\u00f4le ''ObjectStorageScan'' attend un attribut unique. Le type de cet attribut doit \u00eatre ''rstring''.
OBJECTSTORAGE_DS_INVALID_ATTRIBUTE=CDIST3307E Un attribut de type ''rstring'' \u00e9tait attendu, mais un attribut de type ''{0}'' a \u00e9t\u00e9 trouv\u00e9. 
OBJECTSTORAGE_DS_CONSISTENT_REGION_NOT_SUPPORTED=CDIST3308W La pr\u00e9sence d''un port de contr\u00f4le dans une r\u00e9gion coh\u00e9rente n''est pas prise en charge. Les informations de contr\u00f4le risquent de ne pas \u00eatre restitu\u00e9es, conserv\u00e9es et restaur\u00e9es correctement. Vous devrez peut-\u00eatre r\u00e9ex\u00e9cuter manuellement les signaux de contr\u00f4le pour restaurer un \u00e9tat coh\u00e9rent pour l''op\u00e9rateur."
OBJECTSTORAGE_DS_INVALID_OUTPUT_PORT=CDIST3309E Le port de sortie de l''op\u00e9rateur ObjectStorageScan attend un attribut unique. Le type de cet attribut doit \u00eatre ''rstring''.
OBJECTSTORAGE_DS_INVALID_DIRECTORY_PARAM=CDIST3310E Le param\u00e8tre de r\u00e9pertoire doit \u00eatre indiqu\u00e9 si l''op\u00e9rateur ne poss\u00e8de pas de port d''entr\u00e9e.
OBJECTSTORAGE_DS_INVALID_SLEEP_TIMER_PARAM=CDIST3311E La valeur sleepTime du param\u00e8tre d''op\u00e9rateur ne doit pas \u00eatre inf\u00e9rieure \u00e0 0.
OBJECTSTORAGE_DS_INVALID_INIT_DELAY_PARAM=CDIST3312E La valeur initDelay du param\u00e8tre d''op\u00e9rateur ne doit pas \u00eatre inf\u00e9rieure \u00e0 0.
OBJECTSTORAGE_DS_INVALID_PATTERN_PARAM=CDIST3313E est un mod\u00e8le non valide.
OBJECTSTORAGE_DS_INVALID_URL_PARAM=CDIST3314E Le param\u00e8tre ''{0}'' contient un URI non valide : ''{1}''.
OBJECTSTORAGE_DS_INVALID_DIRECTORY_SCHEMA=CDIST3315E Le sch\u00e9ma ''directory'' ''{0}'' doit correspondre au sch\u00e9ma ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_DS_INVALID_HOST_DIRECTORY_SCHEMA=CDIST3316E L''h\u00f4te et le port indiqu\u00e9s par le param\u00e8tre ''directory'' ''{0}'' doivent correspondre \u00e0 l''h\u00f4te et au port indiqu\u00e9s par le param\u00e8tre ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_DS_NOT_SPECIFIED_DIRECTORY_PARAM=CDIST3317E Le param\u00e8tre directory doit \u00eatre indiqu\u00e9 en l''absence de port d''entr\u00e9e de contr\u00f4le.
OBJECTSTORAGE_DS_NOT_SPECIFIED_DIR_PARAM=CDIST3318E Le param\u00e8tre directory n''est pas indiqu\u00e9. Analyse bas\u00e9e sur l''entr\u00e9e provenant du port de contr\u00f4le.
OBJECTSTORAGE_DS_EMPTY_DIRECTORY_STRICT_MODE=CDIST3319E Le param\u00e8tre strictMode a pour valeur true mais le param\u00e8tre directory est vide.
OBJECTSTORAGE_DS_DIRECTORY_NOT_EXIST_STRICT_MODE=CDIST3320E Le param\u00e8tre ''strictMode'' a pour valeur true mais le r\u00e9pertoire ''{0}'' n''existe pas.
OBJECTSTORAGE_DS_IS_NOT_A_DIRECTORY=CDIST3321E La valeur ''{0}'' du param\u00e8tre ''directory'' ne renvoie pas \u00e0 un r\u00e9pertoire valide.
OBJECTSTORAGE_DS_EMPTY_DIRECTORY_PARAM=CDIST3322E la valeur du param\u00e8tre de r\u00e9pertoire est vide.
OBJECTSTORAGE_DS_EMPTY_DIRECTORY_NOT_CONTROL_PORT=CDIST3323E La valeur du param\u00e8tre de r\u00e9pertoire est vide et le port d''entr\u00e9e de contr\u00f4le n''est pas indiqu\u00e9.
OBJECTSTORAGE_DS_DIRECTORY_NOT_EXIST=CDIST3324E Le r\u00e9pertoire ''{0}'' indiqu\u00e9 n''existe pas.
OBJECTSTORAGE_DS_DIRECTORY_NOT_EXIST_INPUT_PORT=CDIST3325E Le r\u00e9pertoire indiqu\u00e9 \u00e0 partir du port d''entr\u00e9e de contr\u00f4le ''{0}'' n''existe pas. 
OBJECTSTORAGE_DS_INVALID_DIRECTORY_INPUT_PORT=CDIST3326E Le r\u00e9pertoire indiqu\u00e9 \u00e0 partir du port d''entr\u00e9e de contr\u00f4le ''{0}'' n''est pas valide.
OBJECTSTORAGE_DS_EMPTY_DIRECTORY_INPUT_PORT=CDIST3327E Le r\u00e9pertoire re\u00e7u du port d''entr\u00e9e est vide.
OBJECTSTORAGE_DS_PUNCTUATION_FAILED=CDIST3328E Probl\u00e8me lors de l''envoi de la ponctuation finale ''{0}''.
OBJECTSTORAGE_DS_SUBMITTING_FAILED=CDIST3329E Probl\u00e8me lors de la soumission du bloc de donn\u00e9es ''{0}''.
OBJECTSTORAGE_SINK_OUTPUT_PORT=CDIST3330E Le port de sortie facultatif doit avoir deux attributs : ''rstring'' comme nom d''objet et ''uint64'' comme taille d''objet.
OBJECTSTORAGE_SINK_FIRST_OUTPUT_PORT=CDIST3331E Le premier attribut dans le port de sortie facultatif doit \u00eatre de type ''rstring''.
OBJECTSTORAGE_SINK_SECOND_OUTPUT_PORT=CDIST3332E Le deuxi\u00e8me attribut dans le port de sortie facultatif doit \u00eatre de type ''uint64''.
OBJECTSTORAGE_SINK_ONE_ATTR_INPUT_PORT=CDIST3333E Le flux d''entr\u00e9e doit comporter un attribut, sauf si ''{0}'' est indiqu\u00e9.
OBJECTSTORAGE_SINK_TWO_ATTR_INPUT_PORT=CDIST3334E Le flux d''entr\u00e9e doit comporter un attribut, sauf si ''{0}'' est indiqu\u00e9, et deux attributs lorsque ''{1}'' a la valeur ''true''.
OBJECTSTORAGE_SINK_INVALID_ATTR_TYPE=CDIST3335E Attribut de type ''blob'', ''rstring'' ou ''ustring'' attendu sur le port d''entr\u00e9e, mais attribut de type ''{1}'' trouv\u00e9. 
OBJECTSTORAGE_SINK_INVALID_NAME_TYPE=CDIST3336E L''attribut de nom d''objet doit \u00eatre de type ''ustring'' ou ''rstring'' . L''attribut de donn\u00e9es doit \u00eatre de type ''blob'', ''ustring'' ou ''rstring''.
#CDIST3337E
OBJECTSTORAGE_SINK_INVALID_VALUE_BYTEPEROBJECT=CDIST3338E La valeur du param\u00e8tre d''op\u00e9rateur ''bytesPerObject'' ne doit pas \u00eatre inf\u00e9rieure \u00e0 0.
OBJECTSTORAGE_SINK_INVALID_VALUE_TUPLESPEROBJECT=CDIST3339E La valeur du param\u00e8tre d''op\u00e9rateur ''tuplesPerObject'' ne doit pas \u00eatre inf\u00e9rieure \u00e0 0.
OBJECTSTORAGE_SINK_INVALID_VALUE_TIMEPEROBJECT=CDIST3340E La valeur du param\u00e8tre d''op\u00e9rateur ''timePerObject'' ne doit pas \u00eatre inf\u00e9rieure \u00e0 0.
OBJECTSTORAGE_SINK_INVALID_DATA_ATTR_TYPE=CDIST3341E L''attribut de donn\u00e9es doit \u00eatre de type ''ustring'', ''rstring'' ou ''blob''. L''attribut trouv\u00e9 est de type ''{0}''. 
OBJECTSTORAGE_SINK_WRONG_TYPE=CDIST3342E Attribut de type ''rstring'' ou ''ustring'' attendu sur le port d''entr\u00e9e, mais attribut de type ''{0}'' trouv\u00e9.
OBJECTSTORAGE_SINK_NO_ATTRIBUTE=CDIST3343E Aucun attribut dans le flux d''entr\u00e9e.
OBJECTSTORAGE_SINK_INVALID_SCHEMA=CDIST3344E Le sch\u00e9ma ''objectName'' ''{0}'' doit correspondre au sch\u00e9ma ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_SINK_INVALID_HOST=CDIST3345E L''h\u00f4te et le port indiqu\u00e9s par le param\u00e8tre ''objectName'' ''{0}'' doivent correspondre \u00e0 l''h\u00f4te et au port indiqu\u00e9s par le param\u00e8tre ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_SINK_SET_RESTARTING=CDIST3346E Red\u00e9marrage d\u00e9fini sur true.
OBJECTSTORAGE_SOURCE_INVALID_URL=CDIST3347E Impossible de construire l''URI : ''{0}''.
OBJECTSTORAGE_SOURCE_INVALID_PARAM=CDIST3348E L''op\u00e9rateur requiert la sp\u00e9cification du param\u00e8tre ''objectName'' ou un seul port d''entr\u00e9e.
OBJECTSTORAGE_SOURCE_ONLY_ONE_PARAM=CDIST3349E L''op\u00e9rateur requiert la sp\u00e9cification du param\u00e8tre ''objectName'' ou un seul port d''entr\u00e9e. Les deux ne peuvent pas \u00eatre sp\u00e9cifi\u00e9s en m\u00eame temps.
OBJECTSTORAGE_SOURCE_INVALID_OUTPUT=CDIST3350E Le port de sortie ne peut avoir qu''un attribut. Le type de cet attribut doit \u00eatre ''rstring'', ''ustring'' ou ''blob''.
OBJECTSTORAGE_SOURCE_INVALID_ATTR_TYPE=CDIST3351E Attribut de type ''rstring'', ''ustring'' ou ''blob'' attendu, mais attribut de type ''{0}'' trouv\u00e9.
OBJECTSTORAGE_SOURCE_INVALID_BLOCKSIZE_PARAM=CDIST3352E ''{0}'' n''est utilisable que lorsque l''attribut ''outstream'' est de type ''blob'' .
OBJECTSTORAGE_SOURCE_INVALID_FILENAME_ATTR=CDIST3353E Un seul attribut est attendu sur le port d''entr\u00e9e. L''attribut doit \u00eatre de type ''rstring'' en indiquant un objet \u00e0 ouvrir.
OBJECTSTORAGE_SOURCE_INVALID_STRING_ATTR=CDIST3354E Un attribut de type ''rstring'' \u00e9tait attendu, mais un attribut de type ''{0}'' a \u00e9t\u00e9 trouv\u00e9.
OBJECTSTORAGE_SOURCE_INVALID_OBJECTSTORAGE_URL=CDIST3355E Le param\u00e8tre ''objectStorageUri'' contient un URI non valide : ''{0}''. 
OBJECTSTORAGE_SOURCE_INVALID_SCHEMA=CDIST3356E Le sch\u00e9ma ''objectName'' ''{0}'' doit correspondre au sch\u00e9ma ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_SOURCE_INVALID_FILE_URL=CDIST3357E Le param\u00e8tre ''objectName'' contient un URI non valide : ''{0}''.
OBJECTSTORAGE_SOURCE_INVALID_HOST=CDIST3358E L''h\u00f4te et le port indiqu\u00e9s par le param\u00e8tre ''objectName'' ''{0}'' doivent correspondre \u00e0 l''h\u00f4te et au port indiqu\u00e9s par le param\u00e8tre ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_SOURCE_PROCESS_OBJECT=CDIST3359I Traitement de l''objet : ''{0}''.
OBJECTSTORAGE_SOURCE_NOT_OPENING_OBJECT=CDIST3360E Probl\u00e8me lors de l''ouverture de l''objet : ''{0}''.
OBJECTSTORAGE_SOURCE_EXCEPTION_READ_OBJECT=CDIST3361E Une exception s''est produite lors de la lecture : ''{0}''. 
OBJECTSTORAGE_SOURCE_INIT_DELAY_INTERRUPTED=CDIST3362E D\u00e9lai d''initialisation interrompu.
OBJECTSTORAGE_SOURCE_EMPTY_OBJECT_NAME=CDIST3363E Le nom d''objet est une cha\u00eene vide. Il va \u00eatre ignor\u00e9.
OBJECTSTORAGE_SOURCE_INVALID_INIT_DELAY_PARAM=CDIST3364E La valeur initDelay du param\u00e8tre d''op\u00e9rateur ne doit pas \u00eatre inf\u00e9rieure \u00e0 0.
#CDIST3365E 
OBJECTSTORAGE_SINK_AUTH_CONNECT=CDIST3366E Connexion impossible au noeud final Cloud Object Storage : ''{0}''.
OBJECTSTORAGE_NOT_CHECKPOINT_PERIODIC=CDIST3367E L''op\u00e9rateur suivant ne prend pas en charge la configuration de point de contr\u00f4le de type ''periodic'' : ''{0}''.
OBJECTSTORAGE_NOT_CHECKPOINT_OPERATOR_DRIVEN=CDIST3368E L''op\u00e9rateur suivant ne prend pas en charge la configuration de point de contr\u00f4le de type ''operatorDriven'' : ''{0}''. 
OBJECTSTORAGE_SINK_PARQUET_STORAGE_FORMAT_REQUIRED=CDIST3369E le param\u00e8tre de configuration ''{0}'' sp\u00e9cifique au format Parquet requiert que le param\u00e8tre de format de stockage ''{1}'' soit d\u00e9fini avec la valeur ''{2}'' 
OBJECTSTORAGE_SINK_PARTION_VALUE_ATTRIBUTES_REQUIRED=CDIST3370E Le param\u00e8tre de configuration ''{0}'' sp\u00e9cifique \u00e0 la partition requiert que le param\u00e8tre d''attributs de partition ''{1}'' soit d\u00e9fini
OBJECTSTORAGE_SINK_OBJECT_CLOSED_PRIOR_RP_EXPIRY=CDIST3371W Objet ''{0}'' ferm\u00e9 avant expiration de la r\u00e8gle de roulement.
OBJECTSTORAGE_SINK_MAX_PARTITIONS_COUNT_REACHED=CDIST3372W Le nombre d''objets actifs (partitions) ''{0}'' d\u00e9passe la limite du cache ''{1}''. Pour \u00e9viter la d\u00e9gradation des performances, il est vivement recommand\u00e9 de r\u00e9duire le nombre de partitions actives.
OBJECTSTORAGE_SINK_OBJECT_WRITE_FAILURE=CDIST3373E Impossible d''\u00e9crire l''objet ''{0}{1}'' : ''{2}''.
OBJECTSTORAGE_SINK_OBJECT_CLOSE_FAILURE=CDIST3374E Impossible de fermer l''objet ''{0}{1}'' : ''{2}''.
OBJECTSTORAGE_BUCKET_NOT_FOUND=CDIST3375E Le compartiment ''{0}'' n''existe pas.
OBJECTSTORAGE_SINK_INVALID_URL=CDIST3376E Impossible de construire l''URI pour l''objet nomm\u00e9 : ''{0}''.
