# NLS_MESSAGEFORMAT_ALL
# NLS_ENCODING=UNICODE
# com.ibm.streamsx.objectstorage Messages Range CDIST3300 to CDIST3399 

# TRNOTE - Do not translate: SPL
OBJECTSTORAGE_NOT_CONSISTENT_REGION=CDIST3300E \u0423\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0439 \u043d\u0438\u0436\u0435 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u043d\u0430\u0447\u0430\u043b\u043e\u043c \u043d\u0435\u043f\u0440\u043e\u0442\u0438\u0432\u043e\u0440\u0435\u0447\u0438\u0432\u043e\u0439 \u043e\u0431\u043b\u0430\u0441\u0442\u0438, \u0435\u0441\u043b\u0438 \u043f\u0440\u0438\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0432\u0445\u043e\u0434\u043d\u043e\u0439 \u043f\u043e\u0440\u0442: ''{0}''.
OBJECTSTORAGE_ASYNC_UNABLE_WRITE_TO_STREAMS=CDIST3301E \u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u043f\u0440\u043e\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0437\u0430\u043f\u0438\u0441\u044c \u0432 \u0432\u044b\u0445\u043e\u0434\u043d\u043e\u0439 \u043f\u043e\u0442\u043e\u043a COS.
OBJECTSTORAGE_ASYNC_UNABLE_ADD_TO_QUEUE=CDIST3302E \u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u0434\u043e\u0431\u0430\u0432\u0438\u0442\u044c \u0431\u0443\u0444\u0435\u0440 \u0432 \u043e\u0447\u0435\u0440\u0435\u0434\u044c \u0431\u0443\u0444\u0435\u0440\u043e\u0432.
OBJECTSTORAGE_ASYNC_INVALID_BUFFER_QUEUE=CDIST3303E \u041e\u0448\u0438\u0431\u043a\u0430 \u043f\u0440\u0438 \u043d\u0430\u0441\u0442\u0440\u043e\u0439\u043a\u0435 \u043e\u0447\u0435\u0440\u0435\u0434\u0438 \u0431\u0443\u0444\u0435\u0440\u043e\u0432.
OBJECTSTORAGE_ASYNC_SERVICE_SHUTDOWN_INTERRUPTED=CDIST3304W \u0417\u0430\u0432\u0435\u0440\u0448\u0435\u043d\u0438\u0435 \u0440\u0430\u0431\u043e\u0442\u044b \u0441\u043b\u0443\u0436\u0431\u044b \u0438\u0441\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u044f \u043f\u0440\u0435\u0440\u0432\u0430\u043d\u043e.
OBJECTSTORAGE_ASYNC_UNABLE_GET_BUFFER_QUEUE=CDIST3305E \u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u043f\u043e\u043b\u0443\u0447\u0438\u0442\u044c \u0431\u0443\u0444\u0435\u0440 \u0438\u0437 \u043e\u0447\u0435\u0440\u0435\u0434\u0438 \u0431\u0443\u0444\u0435\u0440\u043e\u0432.
OBJECTSTORAGE_DS_INVALID_INPUT_PORT=CDIST3306E \u0423\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0438\u0439 \u0432\u0445\u043e\u0434\u043d\u043e\u0439 \u043f\u043e\u0440\u0442 ''ObjectStorageScan'' \u043e\u0436\u0438\u0434\u0430\u0435\u0442 \u043e\u0434\u0438\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442. \u0422\u0438\u043f\u043e\u043c \u044d\u0442\u043e\u0433\u043e \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c ''rstring''.
OBJECTSTORAGE_DS_INVALID_ATTRIBUTE=CDIST3307E \u041e\u0436\u0438\u0434\u0430\u043b\u0441\u044f \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''rstring'', \u043d\u043e \u043d\u0430\u0439\u0434\u0435\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''{0}''. 
OBJECTSTORAGE_DS_CONSISTENT_REGION_NOT_SUPPORTED=CDIST3308W \u041d\u0430\u043b\u0438\u0447\u0438\u0435 \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0435\u0433\u043e \u043f\u043e\u0440\u0442\u0430 \u0432 \u043d\u0435\u043f\u0440\u0435\u0440\u044b\u0432\u043d\u043e\u0439 \u043e\u0431\u043b\u0430\u0441\u0442\u0438 \u043d\u0435 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044f. \u0423\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0430\u044f \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u043c\u043e\u0436\u0435\u0442 \u043d\u0435 \u0432\u043e\u0441\u043f\u0440\u043e\u0438\u0437\u0432\u043e\u0434\u0438\u0442\u044c\u0441\u044f, \u043d\u0435 \u0441\u043e\u0445\u0440\u0430\u043d\u044f\u0442\u044c\u0441\u044f \u0438 \u043d\u0435 \u0432\u043e\u0441\u0441\u0442\u0430\u043d\u0430\u0432\u043b\u0438\u0432\u0430\u0442\u044c\u0441\u044f \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u044b\u043c \u043e\u0431\u0440\u0430\u0437\u043e\u043c. \u0412\u043e\u0437\u043c\u043e\u0436\u043d\u043e, \u0432\u0430\u043c \u043f\u0440\u0438\u0434\u0435\u0442\u0441\u044f \u0432\u0440\u0443\u0447\u043d\u0443\u044e \u0432\u043e\u0441\u043f\u0440\u043e\u0438\u0437\u0432\u0435\u0441\u0442\u0438 \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0438\u0435 \u0441\u0438\u0433\u043d\u0430\u043b\u044b, \u0447\u0442\u043e\u0431\u044b \u0432\u0435\u0440\u043d\u0443\u0442\u044c \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 \u0432 \u043d\u0435\u043f\u0440\u043e\u0442\u0438\u0432\u043e\u0440\u0435\u0447\u0438\u0432\u043e\u0435 \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u0435."
OBJECTSTORAGE_DS_INVALID_OUTPUT_PORT=CDIST3309E \u0412\u044b\u0445\u043e\u0434\u043d\u043e\u0439 \u043f\u043e\u0440\u0442 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 ObjectStorageScan \u043e\u0436\u0438\u0434\u0430\u0435\u0442 \u043e\u0434\u0438\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442. \u0422\u0438\u043f\u043e\u043c \u044d\u0442\u043e\u0433\u043e \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c ''rstring''.
OBJECTSTORAGE_DS_INVALID_DIRECTORY_PARAM=CDIST3310E \u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 directory \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u0437\u0430\u0434\u0430\u0442\u044c, \u0435\u0441\u043b\u0438 \u0443 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u043d\u0435\u0442 \u043d\u0438\u043a\u0430\u043a\u043e\u0433\u043e \u0432\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0440\u0442\u0430.
OBJECTSTORAGE_DS_INVALID_SLEEP_TIMER_PARAM=CDIST3311E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 sleepTime \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u043d\u0435 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u043c\u0435\u043d\u044c\u0448\u0435 0.
OBJECTSTORAGE_DS_INVALID_INIT_DELAY_PARAM=CDIST3312E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 initDelay \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u043d\u0435 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u043c\u0435\u043d\u044c\u0448\u0435 0.
OBJECTSTORAGE_DS_INVALID_PATTERN_PARAM=CDIST3313E \u041d\u0435\u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u044b\u0439 \u0448\u0430\u0431\u043b\u043e\u043d.
OBJECTSTORAGE_DS_INVALID_URL_PARAM=CDIST3314E \u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 ''{0}'' \u0441\u043e\u0434\u0435\u0440\u0436\u0438\u0442 \u043d\u0435\u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043b\u044c\u043d\u044b\u0439 URI: ''{1}''.
OBJECTSTORAGE_DS_INVALID_DIRECTORY_SCHEMA=CDIST3315E \u0421\u0445\u0435\u043c\u0430 ''directory'' ''{0}'' \u0434\u043e\u043b\u0436\u043d\u0430 \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u043e\u0432\u0430\u0442\u044c \u0441\u0445\u0435\u043c\u0435 ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_DS_INVALID_HOST_DIRECTORY_SCHEMA=CDIST3316E \u0425\u043e\u0441\u0442 \u0438 \u043f\u043e\u0440\u0442, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u0435 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u043c ''directory'' ''{0}'', \u0434\u043e\u043b\u0436\u043d\u044b \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u043e\u0432\u0430\u0442\u044c \u0445\u043e\u0441\u0442\u0443 \u0438 \u043f\u043e\u0440\u0442\u0443, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u043c\u0438 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u043c ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_DS_NOT_SPECIFIED_DIRECTORY_PARAM=CDIST3317E \u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 directory \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u0437\u0430\u0434\u0430\u0442\u044c, \u0435\u0441\u043b\u0438 \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0438\u0439 \u0432\u0445\u043e\u0434\u043d\u043e\u0439 \u043f\u043e\u0440\u0442 \u043d\u0435 \u043f\u0440\u0438\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u0435\u0442.
OBJECTSTORAGE_DS_NOT_SPECIFIED_DIR_PARAM=CDIST3318E \u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 directory \u043d\u0435 \u0437\u0430\u0434\u0430\u043d. \u0421\u043a\u0430\u043d\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435 \u043e\u0441\u043d\u043e\u0432\u0430\u043d\u043e \u043d\u0430 \u0432\u0445\u043e\u0434\u043d\u044b\u0445 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f\u0445 \u043e\u0442 \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0435\u0433\u043e \u043f\u043e\u0440\u0442\u0430.
OBJECTSTORAGE_DS_EMPTY_DIRECTORY_STRICT_MODE=CDIST3319E \u0414\u043b\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 strictMode \u0437\u0430\u0434\u0430\u043d\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 true, \u043d\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u0430 (directory) - \u043f\u0443\u0441\u0442\u043e\u0439.
OBJECTSTORAGE_DS_DIRECTORY_NOT_EXIST_STRICT_MODE=CDIST3320E \u0414\u043b\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 ''strictMode'' \u0437\u0430\u0434\u0430\u043d\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 true, \u043d\u043e \u043a\u0430\u0442\u0430\u043b\u043e\u0433 ''{0}'' \u043d\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442.
OBJECTSTORAGE_DS_IS_NOT_A_DIRECTORY=CDIST3321E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 ''directory'' ''{0}'' \u043d\u0435 \u0441\u0441\u044b\u043b\u0430\u0435\u0442\u0441\u044f \u043d\u0430 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043b\u044c\u043d\u044b\u0439 \u043a\u0430\u0442\u0430\u043b\u043e\u0433.
OBJECTSTORAGE_DS_EMPTY_DIRECTORY_PARAM=CDIST3322E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 directory - \u043f\u0443\u0441\u0442\u043e\u0435.
OBJECTSTORAGE_DS_EMPTY_DIRECTORY_NOT_CONTROL_PORT=CDIST3323E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 directory - \u043f\u0443\u0441\u0442\u043e\u0435, \u0438 \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0438\u0439 \u0432\u0445\u043e\u0434\u043d\u043e\u0439 \u043f\u043e\u0440\u0442 \u043d\u0435 \u0437\u0430\u0434\u0430\u043d.
OBJECTSTORAGE_DS_DIRECTORY_NOT_EXIST=CDIST3324E \u0423\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0439 \u043a\u0430\u0442\u0430\u043b\u043e\u0433 ''{0}'' \u043d\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442.
OBJECTSTORAGE_DS_DIRECTORY_NOT_EXIST_INPUT_PORT=CDIST3325E \u041a\u0430\u0442\u0430\u043b\u043e\u0433, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u0439 \u0438\u0437 \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0435\u0433\u043e \u0432\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0440\u0442\u0430 ''{0}'', \u043d\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442. 
OBJECTSTORAGE_DS_INVALID_DIRECTORY_INPUT_PORT=CDIST3326E \u041a\u0430\u0442\u0430\u043b\u043e\u0433, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u0439 \u0438\u0437 \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0435\u0433\u043e \u0432\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0440\u0442\u0430 ''{0}'', \u043d\u0435 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043b\u044c\u043d\u044b\u043c \u043a\u0430\u0442\u0430\u043b\u043e\u0433\u043e\u043c.
OBJECTSTORAGE_DS_EMPTY_DIRECTORY_INPUT_PORT=CDIST3327E \u041a\u0430\u0442\u0430\u043b\u043e\u0433, \u043f\u043e\u043b\u0443\u0447\u0435\u043d\u043d\u044b\u0439 \u0438\u0437 \u0432\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0440\u0442\u0430, \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043f\u0443\u0441\u0442\u044b\u043c.
OBJECTSTORAGE_DS_PUNCTUATION_FAILED=CDIST3328E \u041e\u0448\u0438\u0431\u043a\u0430 \u043f\u0440\u0438 \u043e\u0442\u043f\u0440\u0430\u0432\u043a\u0435 \u043e\u043a\u043e\u043d\u0447\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0439 \u043f\u0443\u043d\u043a\u0442\u0443\u0430\u0446\u0438\u0438 ''{0}''.
OBJECTSTORAGE_DS_SUBMITTING_FAILED=CDIST3329E \u041e\u0448\u0438\u0431\u043a\u0430 \u043f\u0440\u0438 \u043f\u0435\u0440\u0435\u0434\u0430\u0447\u0435 \u043a\u043e\u0440\u0442\u0435\u0436\u0430 ''{0}''.
OBJECTSTORAGE_SINK_OUTPUT_PORT=CDIST3330E \u0423 \u043d\u0435\u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0433\u043e \u0432\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0440\u0442\u0430 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u0434\u0432\u0430 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430: ''rstring'' \u0434\u043b\u044f \u0438\u043c\u0435\u043d\u0438 \u043e\u0431\u044a\u0435\u043a\u0442\u0430 \u0438 ''uint64'' \u0434\u043b\u044f \u0440\u0430\u0437\u043c\u0435\u0440\u0430 \u043e\u0431\u044a\u0435\u043a\u0442\u0430.
OBJECTSTORAGE_SINK_FIRST_OUTPUT_PORT=CDIST3331E \u041f\u0435\u0440\u0432\u044b\u0439 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u043d\u0430 \u043d\u0435\u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u043c \u0432\u044b\u0445\u043e\u0434\u043d\u043e\u043c \u043f\u043e\u0440\u0442\u0443 \u0434\u043e\u043b\u0436\u0435\u043d \u043e\u0442\u043d\u043e\u0441\u0438\u0442\u044c\u0441\u044f \u043a \u0442\u0438\u043f\u0443 ''rstring'' .
OBJECTSTORAGE_SINK_SECOND_OUTPUT_PORT=CDIST3332E \u0412\u0442\u043e\u0440\u043e\u0439 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u043d\u0430 \u043d\u0435\u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u043c \u0432\u044b\u0445\u043e\u0434\u043d\u043e\u043c \u043f\u043e\u0440\u0442\u0443 \u043e\u0448\u0438\u0431\u043e\u043a \u0434\u043e\u043b\u0436\u0435\u043d ''uint64''.
OBJECTSTORAGE_SINK_ONE_ATTR_INPUT_PORT=CDIST3333E \u0423 \u0432\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0442\u043e\u043a\u0430 \u0434\u043e\u043b\u0436\u0435\u043d \u0431\u044b\u0442\u044c \u043e\u0434\u0438\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442, \u0435\u0441\u043b\u0438 \u043d\u0435 \u0437\u0430\u0434\u0430\u043d\u043e ''{0}''.
OBJECTSTORAGE_SINK_TWO_ATTR_INPUT_PORT=CDIST3334E \u0423 \u0432\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0442\u043e\u043a\u0430 \u0434\u043e\u043b\u0436\u0435\u043d \u0431\u044b\u0442\u044c \u043e\u0434\u0438\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442, \u0435\u0441\u043b\u0438 \u043d\u0435 \u0437\u0430\u0434\u0430\u043d\u043e ''{0}'', \u0438 \u0434\u0432\u0430 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430, \u0435\u0441\u043b\u0438 \u0434\u043b\u044f ''{1}'' \u0437\u0430\u0434\u0430\u043d\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 ''true''.
OBJECTSTORAGE_SINK_INVALID_ATTR_TYPE=CDIST3335E \u041e\u0436\u0438\u0434\u0430\u043b\u0441\u044f \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''blob'', ''rstring'' \u0438\u043b\u0438 ''ustring'' \u043d\u0430 \u0432\u0445\u043e\u0434\u043d\u043e\u043c \u043f\u043e\u0440\u0442\u0443, \u0430 \u043e\u0431\u043d\u0430\u0440\u0443\u0436\u0435\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''{1}''. 
OBJECTSTORAGE_SINK_INVALID_NAME_TYPE=CDIST3336E \u0410\u0442\u0440\u0438\u0431\u0443\u0442 objectname \u0434\u043e\u043b\u0436\u0435\u043d \u043e\u0442\u043d\u043e\u0441\u0438\u0442\u044c\u0441\u044f \u043a \u0442\u0438\u043f\u0443 ''ustring'' \u0438\u043b\u0438 ''rstring''. \u0410\u0442\u0440\u0438\u0431\u0443\u0442 \u0434\u0430\u043d\u043d\u044b\u0445 \u0434\u043e\u043b\u0436\u0435\u043d \u043e\u0442\u043d\u043e\u0441\u0438\u0442\u044c\u0441\u044f \u043a \u0442\u0438\u043f\u0443 ''blob'', ''ustring'' \u0438\u043b\u0438 ''rstring''.
#CDIST3337E
OBJECTSTORAGE_SINK_INVALID_VALUE_BYTEPEROBJECT=CDIST3338E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 ''bytesPerObject'' \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u043d\u0435 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u043c\u0435\u043d\u044c\u0448\u0435 0.
OBJECTSTORAGE_SINK_INVALID_VALUE_TUPLESPEROBJECT=CDIST3339E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 ''tuplesPerObject'' \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u043d\u0435 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u043c\u0435\u043d\u044c\u0448\u0435 0.
OBJECTSTORAGE_SINK_INVALID_VALUE_TIMEPEROBJECT=CDIST3340E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 ''timePerObject'' \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u043d\u0435 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u043c\u0435\u043d\u044c\u0448\u0435 0.
OBJECTSTORAGE_SINK_INVALID_DATA_ATTR_TYPE=CDIST3341E \u0422\u0438\u043f\u043e\u043c \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \u0434\u0430\u043d\u043d\u044b\u0445 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c ''ustring'', ''rstring'' \u0438\u043b\u0438 ''blob'' . \u041d\u0430\u0439\u0434\u0435\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''{0}''. 
OBJECTSTORAGE_SINK_WRONG_TYPE=CDIST3342E \u041e\u0436\u0438\u0434\u0430\u043b\u0441\u044f \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''rstring'' \u0438\u043b\u0438 ''ustring'' \u043d\u0430 \u0432\u0445\u043e\u0434\u043d\u043e\u043c \u043f\u043e\u0440\u0442\u0443, \u043e\u0431\u043d\u0430\u0440\u0443\u0436\u0435\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''{0}''.
OBJECTSTORAGE_SINK_NO_ATTRIBUTE=CDIST3343E \u0412 \u0432\u0445\u043e\u0434\u043d\u043e\u043c \u043f\u043e\u0442\u043e\u043a\u0435 \u043d\u0435\u0442 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430.
OBJECTSTORAGE_SINK_INVALID_SCHEMA=CDIST3344E \u0421\u0445\u0435\u043c\u0430 ''objectName'' ''{0}'' \u0434\u043e\u043b\u0436\u043d\u0430 \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u043e\u0432\u0430\u0442\u044c \u0441\u0445\u0435\u043c\u0435 ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_SINK_INVALID_HOST=CDIST3345E \u0425\u043e\u0441\u0442 \u0438 \u043f\u043e\u0440\u0442, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u0435 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u043c ''objectName'' ''{0}'', \u0434\u043e\u043b\u0436\u043d\u044b \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u043e\u0432\u0430\u0442\u044c \u0445\u043e\u0441\u0442\u0443 \u0438 \u043f\u043e\u0440\u0442\u0443, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u043c\u0438 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u043c ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_SINK_SET_RESTARTING=CDIST3346E \u0417\u0430\u0434\u0430\u0439\u0442\u0435 \u0434\u043b\u044f \u043f\u0435\u0440\u0435\u0437\u0430\u043f\u0443\u0441\u043a\u0430 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 true.
OBJECTSTORAGE_SOURCE_INVALID_URL=CDIST3347E \u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u043f\u043e\u0441\u0442\u0440\u043e\u0438\u0442\u044c URI: ''{0}''.
OBJECTSTORAGE_SOURCE_INVALID_PARAM=CDIST3348E \u041e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0443 \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f, \u0447\u0442\u043e\u0431\u044b \u0431\u044b\u043b \u0437\u0430\u0434\u0430\u043d \u043b\u0438\u0431\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 ''objectName'', \u043b\u0438\u0431\u043e \u0447\u0438\u0441\u043b\u043e \u0432\u0445\u043e\u0434\u043d\u044b\u0445 \u043f\u043e\u0440\u0442\u043e\u0432, \u0440\u0430\u0432\u043d\u043e\u0435 \u0435\u0434\u0438\u043d\u0438\u0446\u0435.
OBJECTSTORAGE_SOURCE_ONLY_ONE_PARAM=CDIST3349E \u041e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0443 \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f, \u0447\u0442\u043e\u0431\u044b \u0431\u044b\u043b \u0437\u0430\u0434\u0430\u043d \u043b\u0438\u0431\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 ''objectName'', \u043b\u0438\u0431\u043e \u0447\u0438\u0441\u043b\u043e \u0432\u0445\u043e\u0434\u043d\u044b\u0445 \u043f\u043e\u0440\u0442\u043e\u0432, \u0440\u0430\u0432\u043d\u043e\u0435 \u0435\u0434\u0438\u043d\u0438\u0446\u0435. \u0423\u043a\u0430\u0437\u0430\u0442\u044c \u0438 \u0442\u043e, \u0438 \u0434\u0440\u0443\u0433\u043e\u0435 \u043e\u0434\u043d\u043e\u0432\u0440\u0435\u043c\u0435\u043d\u043d\u043e \u043d\u0435\u043b\u044c\u0437\u044f.
OBJECTSTORAGE_SOURCE_INVALID_OUTPUT=CDIST3350E \u0423 \u0432\u044b\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0440\u0442\u0430 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0442\u043e\u043b\u044c\u043a\u043e \u043e\u0434\u0438\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442. \u0422\u0438\u043f\u043e\u043c \u044d\u0442\u043e\u0433\u043e \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c ''rstring'', ''ustring'' \u0438\u043b\u0438 ''blob''.
OBJECTSTORAGE_SOURCE_INVALID_ATTR_TYPE=CDIST3351E \u041e\u0436\u0438\u0434\u0430\u043b\u0441\u044f \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''rstring'', ''ustring'' \u0438\u043b\u0438 ''blob'', \u0430 \u043e\u0431\u043d\u0430\u0440\u0443\u0436\u0435\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''{0}''.
OBJECTSTORAGE_SOURCE_INVALID_BLOCKSIZE_PARAM=CDIST3352E ''{0}'' \u043c\u043e\u0436\u043d\u043e \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u044c, \u0442\u043e\u043b\u044c\u043a\u043e \u0435\u0441\u043b\u0438 ''outstream'' \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043e\u043c \u0442\u0438\u043f\u0430 ''blob'' .
OBJECTSTORAGE_SOURCE_INVALID_FILENAME_ATTR=CDIST3353E \u041e\u0436\u0438\u0434\u0430\u0435\u0442\u0441\u044f \u0442\u043e\u043b\u044c\u043a\u043e \u043e\u0434\u0438\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u043d\u0430 \u0432\u0445\u043e\u0434\u043d\u043e\u043c \u043f\u043e\u0440\u0442\u0443. \u0410\u0442\u0440\u0438\u0431\u0443\u0442 \u0434\u043e\u043b\u0436\u0435\u043d \u043e\u0442\u043d\u043e\u0441\u0438\u0442\u044c\u0441\u044f \u043a \u0442\u0438\u043f\u0443 ''rstring'', \u0434\u0430\u0432\u0430\u044f \u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e\u0441\u0442\u044c \u043e\u0442\u043a\u0440\u044b\u0442\u044c \u043e\u0431\u044a\u0435\u043a\u0442.
OBJECTSTORAGE_SOURCE_INVALID_STRING_ATTR=CDIST3354E \u041e\u0436\u0438\u0434\u0430\u043b\u0441\u044f \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''rstring'', \u0430 \u043d\u0430\u0439\u0434\u0435\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''{0}''.
OBJECTSTORAGE_SOURCE_INVALID_OBJECTSTORAGE_URL=CDIST3355E \u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 ''objectStorageUri'' \u0441\u043e\u0434\u0435\u0440\u0436\u0438\u0442 \u043d\u0435\u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043b\u044c\u043d\u044b\u0439 URI: ''{0}''. 
OBJECTSTORAGE_SOURCE_INVALID_SCHEMA=CDIST3356E \u0421\u0445\u0435\u043c\u0430 ''objectName'' ''{0}'' \u0434\u043e\u043b\u0436\u043d\u0430 \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u043e\u0432\u0430\u0442\u044c \u0441\u0445\u0435\u043c\u0435 ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_SOURCE_INVALID_FILE_URL=CDIST3357E \u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 ''objectName'' \u0441\u043e\u0434\u0435\u0440\u0436\u0438\u0442 \u043d\u0435\u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043b\u044c\u043d\u044b\u0439 URI: ''{0}''.
OBJECTSTORAGE_SOURCE_INVALID_HOST=CDIST3358E \u0425\u043e\u0441\u0442 \u0438 \u043f\u043e\u0440\u0442, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u0435 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u043c ''objectName'' ''{0}'', \u0434\u043e\u043b\u0436\u043d\u044b \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u043e\u0432\u0430\u0442\u044c \u0445\u043e\u0441\u0442\u0443 \u0438 \u043f\u043e\u0440\u0442\u0443, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u043c\u0438 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u043c ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_SOURCE_PROCESS_OBJECT=CDIST3359I \u041e\u0431\u044a\u0435\u043a\u0442 \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u0430: ''{0}''.
OBJECTSTORAGE_SOURCE_NOT_OPENING_OBJECT=CDIST3360E \u041e\u0448\u0438\u0431\u043a\u0430 \u043f\u0440\u0438 \u043e\u0442\u043a\u0440\u044b\u0442\u0438\u0438 \u043e\u0431\u044a\u0435\u043a\u0442\u0430: ''{0}''.
OBJECTSTORAGE_SOURCE_EXCEPTION_READ_OBJECT=CDIST3361E \u0412\u043e\u0437\u043d\u0438\u043a\u043b\u0430 \u0438\u0441\u043a\u043b\u044e\u0447\u0438\u0442\u0435\u043b\u044c\u043d\u0430\u044f \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u044f \u043f\u0440\u0438 \u0447\u0442\u0435\u043d\u0438\u0438: ''{0}''. 
OBJECTSTORAGE_SOURCE_INIT_DELAY_INTERRUPTED=CDIST3362E \u0417\u0430\u0434\u0435\u0440\u0436\u043a\u0430 \u0438\u043d\u0438\u0446\u0438\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u0438 \u043f\u0440\u0435\u0440\u0432\u0430\u043d\u0430.
OBJECTSTORAGE_SOURCE_EMPTY_OBJECT_NAME=CDIST3363E \u0418\u043c\u044f \u043e\u0431\u044a\u0435\u043a\u0442\u0430 - \u043f\u0443\u0441\u0442\u0430\u044f \u0441\u0442\u0440\u043e\u043a\u0430. \u041f\u0440\u043e\u043f\u0443\u0441\u043a\u0430\u0435\u0442\u0441\u044f.
OBJECTSTORAGE_SOURCE_INVALID_INIT_DELAY_PARAM=CDIST3364E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 initDelay \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430 \u043d\u0435 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u043c\u0435\u043d\u044c\u0448\u0435 0.
#CDIST3365E 
OBJECTSTORAGE_SINK_AUTH_CONNECT=CDIST3366E \u041d\u0435 \u0443\u0434\u0430\u043b\u043e\u0441\u044c \u0441\u043e\u0435\u0434\u0438\u043d\u0438\u0442\u044c\u0441\u044f \u0441 \u043a\u043e\u043d\u0435\u0447\u043d\u043e\u0439 \u0442\u043e\u0447\u043a\u043e\u0439 Could Object Storage: ''{0}''.
OBJECTSTORAGE_NOT_CHECKPOINT_PERIODIC=CDIST3367E \u0423\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0439 \u043d\u0438\u0436\u0435 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 \u043d\u0435 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442 \u043a\u043e\u043d\u0444\u0438\u0433\u0443\u0440\u0430\u0446\u0438\u044e \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044c\u043d\u043e\u0439 \u0442\u043e\u0447\u043a\u0438 ''periodic'': ''{0}''.
OBJECTSTORAGE_NOT_CHECKPOINT_OPERATOR_DRIVEN=CDIST3368E \u0423\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0439 \u043d\u0438\u0436\u0435 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 \u043d\u0435 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442 \u043a\u043e\u043d\u0444\u0438\u0433\u0443\u0440\u0430\u0446\u0438\u044e \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044c\u043d\u043e\u0439 \u0442\u043e\u0447\u043a\u0438 ''operatorDriven'': ''{0}''. 
OBJECTSTORAGE_SINK_PARQUET_STORAGE_FORMAT_REQUIRED=CDIST3369E \u0414\u043b\u044f \u0441\u0432\u044f\u0437\u0430\u043d\u043d\u043e\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043a\u043e\u043d\u0444\u0438\u0433\u0443\u0440\u0430\u0446\u0438\u0438 ''{0}'' \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f, \u0447\u0442\u043e\u0431\u044b \u0434\u043b\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u0444\u043e\u0440\u043c\u0430\u0442\u0430 \u0445\u0440\u0430\u043d\u0435\u043d\u0438\u044f ''{1}'' \u0431\u044b\u043b\u043e \u0437\u0430\u0434\u0430\u043d\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 ''{2}'' 
OBJECTSTORAGE_SINK_PARTION_VALUE_ATTRIBUTES_REQUIRED=CDIST3370E \u0414\u043b\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043a\u043e\u043d\u0444\u0438\u0433\u0443\u0440\u0430\u0446\u0438\u0438, \u0441\u0432\u044f\u0437\u0430\u043d\u043d\u043e\u0433\u043e \u0441 \u0440\u0430\u0437\u0434\u0435\u043b\u043e\u043c, ''{0}'', \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f, \u0447\u0442\u043e\u0431\u044b \u0431\u044b\u043b \u0437\u0430\u0434\u0430\u043d \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043e\u0432 \u0440\u0430\u0437\u0434\u0435\u043b\u0430 ''{1}''
OBJECTSTORAGE_SINK_OBJECT_CLOSED_PRIOR_RP_EXPIRY=CDIST3371W \u041e\u0431\u044a\u0435\u043a\u0442 ''{0}'' \u0431\u044b\u043b \u0437\u0430\u043a\u0440\u044b\u0442 \u0434\u043e \u043e\u043a\u043e\u043d\u0447\u0430\u043d\u0438\u044f \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044f \u043f\u0440\u043e\u043c\u0435\u0436\u0443\u0442\u043e\u0447\u043d\u043e\u0439 \u043f\u043e\u043b\u0438\u0442\u0438\u043a\u0438.
OBJECTSTORAGE_SINK_MAX_PARTITIONS_COUNT_REACHED=CDIST3372W \u0427\u0438\u0441\u043b\u043e \u0430\u043a\u0442\u0438\u0432\u043d\u044b\u0445 \u043e\u0431\u044a\u0435\u043a\u0442\u043e\u0432 (\u0440\u0430\u0437\u0434\u0435\u043b\u043e\u0432) ''{0}'' \u043f\u0440\u0435\u0432\u044b\u0448\u0430\u0435\u0442 \u043f\u0440\u0435\u0434\u0435\u043b \u043a\u044d\u0448\u0430 ''{1}''. \u0427\u0442\u043e\u0431\u044b \u043d\u0435 \u0434\u043e\u043f\u0443\u0441\u0442\u0438\u0442\u044c \u0441\u043d\u0438\u0436\u0435\u043d\u0438\u044f \u043f\u0440\u043e\u0438\u0437\u0432\u043e\u0434\u0438\u0442\u0435\u043b\u044c\u043d\u043e\u0441\u0442\u0438, \u043d\u0430\u0441\u0442\u043e\u044f\u0442\u0435\u043b\u044c\u043d\u043e \u0440\u0435\u043a\u043e\u043c\u0435\u043d\u0434\u0443\u0435\u0442\u0441\u044f \u0441\u043e\u043a\u0440\u0430\u0442\u0438\u0442\u044c \u0447\u0438\u0441\u043b\u043e \u0430\u043a\u0442\u0438\u0432\u043d\u044b\u0445 \u0440\u0430\u0437\u0434\u0435\u043b\u043e\u0432.
OBJECTSTORAGE_SINK_OBJECT_WRITE_FAILURE=CDIST3373E \u041d\u0435 \u0443\u0434\u0430\u043b\u043e\u0441\u044c \u0437\u0430\u043f\u0438\u0441\u0430\u0442\u044c \u043e\u0431\u044a\u0435\u043a\u0442 ''{0}{1}'': ''{2}''.
OBJECTSTORAGE_SINK_OBJECT_CLOSE_FAILURE=CDIST3374E \u041d\u0435 \u0443\u0434\u0430\u043b\u043e\u0441\u044c \u0437\u0430\u043a\u0440\u044b\u0442\u044c \u043e\u0431\u044a\u0435\u043a\u0442 ''{0}{1}'': ''{2}''.
OBJECTSTORAGE_BUCKET_NOT_FOUND=CDIST3375E \u0411\u0430\u043a\u0435\u0442 ''{0}'' \u043d\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442.
OBJECTSTORAGE_SINK_INVALID_URL=CDIST3376E \u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u043f\u043e\u0441\u0442\u0440\u043e\u0438\u0442\u044c URI \u0434\u043b\u044f \u043e\u0431\u044a\u0435\u043a\u0442\u0430 \u0441 \u0438\u043c\u0435\u043d\u0435\u043c: ''{0}''.
