# NLS_MESSAGEFORMAT_ALL
# NLS_ENCODING=UNICODE
# com.ibm.streamsx.objectstorage Messages Range CDIST3300 to CDIST3399 

# TRNOTE - Do not translate: SPL
OBJECTSTORAGE_NOT_CONSISTENT_REGION=CDIST3300E El operador siguiente no puede ser el inicio de una regi\u00f3n coherente cuando el puerto de entrada est\u00e1 presente: ''{0}''.
OBJECTSTORAGE_ASYNC_UNABLE_WRITE_TO_STREAMS=CDIST3301E No se ha podido escribir en la corriente de salida COS.
OBJECTSTORAGE_ASYNC_UNABLE_ADD_TO_QUEUE=CDIST3302E No se ha podido a\u00f1adir almacenamiento intermedio a la cola de almacenamiento intermedio.
OBJECTSTORAGE_ASYNC_INVALID_BUFFER_QUEUE=CDIST3303E Error al configurar la cola de almacenamiento intermedio.
OBJECTSTORAGE_ASYNC_SERVICE_SHUTDOWN_INTERRUPTED=CDIST3304W Se ha interrumpido el cierre del servicio de ejecuci\u00f3n.
OBJECTSTORAGE_ASYNC_UNABLE_GET_BUFFER_QUEUE=CDIST3305E No se ha podido recuperar el almacenamiento intermedio de la cola de almacenamiento intermedio.
OBJECTSTORAGE_DS_INVALID_INPUT_PORT=CDIST3306E El puerto de entrada de control de ''ObjectStorageScan'' espera un \u00fanico atributo. El tipo de este atributo debe ser ''rstring''.
OBJECTSTORAGE_DS_INVALID_ATTRIBUTE=CDIST3307E Se esperaba un atributo de tipo ''rstring'', pero se ha encontrado un atributo de tipo ''{0}''. 
OBJECTSTORAGE_DS_CONSISTENT_REGION_NOT_SUPPORTED=CDIST3308W No est\u00e1 soportado tener un puerto de control en una regi\u00f3n coherente. Es posible que la informaci\u00f3n de control no se reproduzca, persista o restaure correctamente. Es posible que deba reproducir manualmente las se\u00f1ales de control para devolver el operador a un estado coherente."
OBJECTSTORAGE_DS_INVALID_OUTPUT_PORT=CDIST3309E El puerto de salida del operador ObjectStorageScan espera un \u00fanico atributo. El tipo de este atributo debe ser ''rstring''.
OBJECTSTORAGE_DS_INVALID_DIRECTORY_PARAM=CDIST3310E El par\u00e1metro directory se debe especificar si el operador no tiene ning\u00fan puerto de entrada.
OBJECTSTORAGE_DS_INVALID_SLEEP_TIMER_PARAM=CDIST3311E El valor del par\u00e1metro de operador sleepTime no debe ser menor que 0.
OBJECTSTORAGE_DS_INVALID_INIT_DELAY_PARAM=CDIST3312E El valor del par\u00e1metro de operador initDelay no debe ser menor que 0.
OBJECTSTORAGE_DS_INVALID_PATTERN_PARAM=CDIST3313E no es un patr\u00f3n v\u00e1lido.
OBJECTSTORAGE_DS_INVALID_URL_PARAM=CDIST3314E El par\u00e1metro ''{0}'' contiene un URI no v\u00e1lido: ''{1}''.
OBJECTSTORAGE_DS_INVALID_DIRECTORY_SCHEMA=CDIST3315E El esquema ''directory'' ''{0}'' debe coincidir con el esquema ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_DS_INVALID_HOST_DIRECTORY_SCHEMA=CDIST3316E El host y el puerto especificados por el par\u00e1metro ''directory'' ''{0}'' deben coincidir con el host y puerto especificados por el par\u00e1metro ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_DS_NOT_SPECIFIED_DIRECTORY_PARAM=CDIST3317E Se debe especificar el par\u00e1metro directory cuando no est\u00e1 presente el puerto de entrada de control.
OBJECTSTORAGE_DS_NOT_SPECIFIED_DIR_PARAM=CDIST3318E El par\u00e1metro directory no se ha especificado. Exploraci\u00f3n basada en la entrada del puerto de control.
OBJECTSTORAGE_DS_EMPTY_DIRECTORY_STRICT_MODE=CDIST3319E El par\u00e1metro strictMode est\u00e1 establecido en true pero el par\u00e1metro directory est\u00e1 vac\u00edo.
OBJECTSTORAGE_DS_DIRECTORY_NOT_EXIST_STRICT_MODE=CDIST3320E El par\u00e1metro ''strictMode'' est\u00e1 establecido en true pero directory ''{0}'' no existe.
OBJECTSTORAGE_DS_IS_NOT_A_DIRECTORY=CDIST3321E El valor del par\u00e1metro ''directory'' ''{0}'' no hace referencia a un directorio v\u00e1lido.
OBJECTSTORAGE_DS_EMPTY_DIRECTORY_PARAM=CDIST3322E El valor del par\u00e1metro directory est\u00e1 vac\u00edo.
OBJECTSTORAGE_DS_EMPTY_DIRECTORY_NOT_CONTROL_PORT=CDIST3323E El valor del par\u00e1metro directory est\u00e1 vac\u00edo y el puerto de entrada de control no se ha especificado.
OBJECTSTORAGE_DS_DIRECTORY_NOT_EXIST=CDIST3324E El directorio especificado ''{0}'' no existe.
OBJECTSTORAGE_DS_DIRECTORY_NOT_EXIST_INPUT_PORT=CDIST3325E El directorio especificado del puerto de entrada de control ''{0}'' no existe. 
OBJECTSTORAGE_DS_INVALID_DIRECTORY_INPUT_PORT=CDIST3326E El directorio especificado del puerto de entrada de control ''{0}'' no es un directorio v\u00e1lido.
OBJECTSTORAGE_DS_EMPTY_DIRECTORY_INPUT_PORT=CDIST3327E El directorio recibido del puerto de entrada est\u00e1 vac\u00edo.
OBJECTSTORAGE_DS_PUNCTUATION_FAILED=CDIST3328E Problema al enviar la puntuaci\u00f3n final ''{0}''.
OBJECTSTORAGE_DS_SUBMITTING_FAILED=CDIST3329E Problema al enviar la tupla ''{0}''.
OBJECTSTORAGE_SINK_OUTPUT_PORT=CDIST3330E El puerto de salida opcional debe tener dos atributos, ''rstring'' para nombre de objeto, ''uint64'' para tama\u00f1o de objeto.
OBJECTSTORAGE_SINK_FIRST_OUTPUT_PORT=CDIST3331E El primer atributo en el puerto de salida opcional debe ser ''rstring''.
OBJECTSTORAGE_SINK_SECOND_OUTPUT_PORT=CDIST3332E El segundo atributo en el puerto de salida opcional debe ser ''uint64''.
OBJECTSTORAGE_SINK_ONE_ATTR_INPUT_PORT=CDIST3333E La corriente de entrada debe tener un \u00fanico atributo a menos que se especifique ''{0}''.
OBJECTSTORAGE_SINK_TWO_ATTR_INPUT_PORT=CDIST3334E La corriente de entrada debe tener un \u00fanico atributo a menos que ''{0}'' y dos atributos cuando ''{1}'' es ''true''.
OBJECTSTORAGE_SINK_INVALID_ATTR_TYPE=CDIST3335E Se esperaba un atributo de tipo ''blob'', ''rstring'' o ''ustring'' en el puerto de entrada, se ha encontrado un atributo de tipo ''{1}''. 
OBJECTSTORAGE_SINK_INVALID_NAME_TYPE=CDIST3336E El atributo objectname debe ser de tipo ''ustring'' o ''rstring''. El atributo data debe ser de tipo ''blob'', ''ustring'' o ''rstring''.
#CDIST3337E
OBJECTSTORAGE_SINK_INVALID_VALUE_BYTEPEROBJECT=CDIST3338E El valor del par\u00e1metro de operador ''bytesPerObject'' no debe ser menor que 0.
OBJECTSTORAGE_SINK_INVALID_VALUE_TUPLESPEROBJECT=CDIST3339E El valor del par\u00e1metro de operador ''tuplesPerObject'' no debe ser menor que 0.
OBJECTSTORAGE_SINK_INVALID_VALUE_TIMEPEROBJECT=CDIST3340E El valor del par\u00e1metro de operador ''timePerObject'' no debe ser menor que 0.
OBJECTSTORAGE_SINK_INVALID_DATA_ATTR_TYPE=CDIST3341E El atributo data debe tener un tipo ''ustring'', ''rstring'' o ''blob''. Se ha encontrado un atributo de tipo ''{0}''. 
OBJECTSTORAGE_SINK_WRONG_TYPE=CDIST3342E Se esperaba un atributo de tipo ''rstring'' o ''ustring'' en el puerto de entrada, se ha encontrado un atributo de tipo ''{0}''.
OBJECTSTORAGE_SINK_NO_ATTRIBUTE=CDIST3343E No hay ning\u00fan atributo en la corriente de entrada.
OBJECTSTORAGE_SINK_INVALID_SCHEMA=CDIST3344E El esquema ''objectName'' ''{0}'' debe coincidir con el esquema ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_SINK_INVALID_HOST=CDIST3345E El host y el puerto especificados por el par\u00e1metro ''objectName'' ''{0}'' deben coincidir con el host y puerto especificados por el par\u00e1metro ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_SINK_SET_RESTARTING=CDIST3346E Establecer reinicio en true.
OBJECTSTORAGE_SOURCE_INVALID_URL=CDIST3347E No se ha podido construir el URI: ''{0}''.
OBJECTSTORAGE_SOURCE_INVALID_PARAM=CDIST3348E El operador requiere que se especifique el par\u00e1metro ''objectName'' o que el n\u00famero de puertos de entrada sea uno.
OBJECTSTORAGE_SOURCE_ONLY_ONE_PARAM=CDIST3349E El operador requiere que se especifique el par\u00e1metro ''objectName'' o que el n\u00famero de puertos de entrada sea uno. No se pueden especificar ambos juntos.
OBJECTSTORAGE_SOURCE_INVALID_OUTPUT=CDIST3350E El puerto de salida puede tener s\u00f3lo un atributo. El tipo de este atributo debe ser ''rstring'', ''ustring'' o ''blob''.
OBJECTSTORAGE_SOURCE_INVALID_ATTR_TYPE=CDIST3351E Se esperaba un atributo de tipo ''rstring'', ''ustring'' o ''blob'', se ha encontrado un atributo de tipo ''{0}''.
OBJECTSTORAGE_SOURCE_INVALID_BLOCKSIZE_PARAM=CDIST3352E ''{0}'' s\u00f3lo se puede utilizar cuando la ''outstream'' contiene un atributo de tipo ''blob''.
OBJECTSTORAGE_SOURCE_INVALID_FILENAME_ATTR=CDIST3353E Se espera s\u00f3lo un atributo en el puerto de entrada. El atributo debe ser ''rstring'' y dar un objeto para abrir.
OBJECTSTORAGE_SOURCE_INVALID_STRING_ATTR=CDIST3354E Se esperaba un atributo de tipo ''rstring'', se ha encontrado un atributo de tipo ''{0}''.
OBJECTSTORAGE_SOURCE_INVALID_OBJECTSTORAGE_URL=CDIST3355E El par\u00e1metro ''objectStorageUri'' contiene un URI no v\u00e1lido: ''{0}''. 
OBJECTSTORAGE_SOURCE_INVALID_SCHEMA=CDIST3356E El esquema ''objectName'' ''{0}'' debe coincidir con el esquema ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_SOURCE_INVALID_FILE_URL=CDIST3357E El par\u00e1metro ''objectName'' contiene un URI no v\u00e1lido: ''{0}''.
OBJECTSTORAGE_SOURCE_INVALID_HOST=CDIST3358E El host y el puerto especificados por el par\u00e1metro ''objectName'' ''{0}'' deben coincidir con el host y puerto especificados por el par\u00e1metro ''objectStorageUri'' ''{1}''.
OBJECTSTORAGE_SOURCE_PROCESS_OBJECT=CDIST3359I Objeto de proceso: ''{0}''.
OBJECTSTORAGE_SOURCE_NOT_OPENING_OBJECT=CDIST3360E Problema al abrir el objeto: ''{0}''.
OBJECTSTORAGE_SOURCE_EXCEPTION_READ_OBJECT=CDIST3361E Se ha producido una excepci\u00f3n durante la lectura: ''{0}''. 
OBJECTSTORAGE_SOURCE_INIT_DELAY_INTERRUPTED=CDIST3362E Se ha interrumpido el retardo de inicializaci\u00f3n.
OBJECTSTORAGE_SOURCE_EMPTY_OBJECT_NAME=CDIST3363E El nombre de objeto es una serie vac\u00eda. Se omite.
OBJECTSTORAGE_SOURCE_INVALID_INIT_DELAY_PARAM=CDIST3364E El valor del par\u00e1metro de operador initDelay no debe ser menor que 0.
#CDIST3365E 
OBJECTSTORAGE_SINK_AUTH_CONNECT=CDIST3366E No se ha podido conectar al punto final de Cloud Object Storage: ''{0}''.
OBJECTSTORAGE_NOT_CHECKPOINT_PERIODIC=CDIST3367E El operador siguiente no da soporte a la configuraci\u00f3n de punto de comprobaci\u00f3n ''periodic'': ''{0}''.
OBJECTSTORAGE_NOT_CHECKPOINT_OPERATOR_DRIVEN=CDIST3368E El operador siguiente no da soporte a la configuraci\u00f3n de punto de comprobaci\u00f3n ''operatorDriven'': ''{0}''. 
OBJECTSTORAGE_SINK_PARQUET_STORAGE_FORMAT_REQUIRED=CDIST3369E El par\u00e1metro de configuraci\u00f3n espec\u00edfico de parquet ''{0}'' requiere que el par\u00e1metro de formato de almacenamiento ''{1}'' se establezca en el valor ''{2}''
OBJECTSTORAGE_SINK_PARTION_VALUE_ATTRIBUTES_REQUIRED=CDIST3370E El par\u00e1metro de configuraci\u00f3n espec\u00edfico de partici\u00f3n ''{0}'' requiere que se defina el par\u00e1metro de atributos de partici\u00f3n ''{1}''
OBJECTSTORAGE_SINK_OBJECT_CLOSED_PRIOR_RP_EXPIRY=CDIST3371W Objeto ''{0}'' cerrado antes de la caducidad de la pol\u00edtica de rotaci\u00f3n.
OBJECTSTORAGE_SINK_MAX_PARTITIONS_COUNT_REACHED=CDIST3372W El n\u00famero de objetos activos (particiones) ''{0}'' supera el l\u00edmite de memoria cach\u00e9 ''{1}''. Para evitar la degradaci\u00f3n del rendimiento se recomienda encarecidamente reducir el n\u00famero de particiones activas.
OBJECTSTORAGE_SINK_OBJECT_WRITE_FAILURE=CDIST3373E No se ha podido escribir el objeto ''{0}{1}'': ''{2}''.
OBJECTSTORAGE_SINK_OBJECT_CLOSE_FAILURE=CDIST3374E No se ha podido cerrar el objeto ''{0}{1}'': ''{2}''.
OBJECTSTORAGE_BUCKET_NOT_FOUND=CDIST3375E El grupo ''{0}'' no existe.
OBJECTSTORAGE_SINK_INVALID_URL=CDIST3376E No se ha podido construir el URI para el objeto llamado ''{0}''.
